app/controllers/admin/users_controller.rb

INSERT INTO "users" ("admin", "created_at", "email", "firstname", "lastname", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users"   ORDER BY lastname LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order("lastname").page(params[:page])

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "users" SET "firstname" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 13  [["firstname", "William"], ["password_digest", "$2a$10$VeCX0mG9vAy.lmFYY.Tn2eZdCguOpM9LTWb8kr8MVDgIQxA1vYRhW"], ["updated_at", "2015-07-23 03:17:49.261410"]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)