app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
<% if current_user %>
  <% @movie.reviews.each do |review| %>