app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
---
SELECT "movies".* FROM "movies"  WHERE (title LIKE '%Avengers%' AND director LIKE '%Joss%') AND (runtime_in_minutes < 90)

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_content_type", "poster_file_name", "poster_file_size", "poster_updated_at", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])
    if @movie.update_attributes(movie_params)
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "poster_content_type" = ?, "poster_file_name" = ?, "poster_file_size" = ?, "poster_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = 1