app/controllers/reviews_controller.rb

  def create
    @movie = Movie.find(params[:movie_id])
    @review = @movie.reviews.build(review_params)
    @review.user_id = current_user.id

    if @review.save
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-07-22 00:04:23.658364"], ["movie_id", 1], ["rating_out_of_ten", 10], ["text", "TOO GOOD"], ["updated_at", "2015-07-22 00:04:23.658364"], ["user_id", 1]]

  def load_movie
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]